; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph0 - mode
	infrared1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star11 - direction
	Star12 - direction
	Star9 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared1)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 Star12)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(have_image Phenomenon13 image3)
	(have_image Phenomenon14 infrared1)
	(have_image Star15 infrared2)
	(have_image Planet16 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 phenomenon13 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 4
3. (turn_to satellite0 star9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star9)
   goals met: 0 of 4
4. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 0 of 4
5. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 4
6. (take_image satellite0 phenomenon13 instrument0 image3)
   added: (have_image phenomenon13 image3)
   goals met: 1 of 4
7. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 4
8. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 2 of 4
9. (turn_to satellite0 planet16 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet16)
   goals met: 2 of 4
10. (take_image satellite0 planet16 instrument0 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 3 of 4
11. (turn_to satellite0 star15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star15)
   goals met: 3 of 4
12. (take_image satellite0 star15 instrument0 infrared2)
   added: (have_image star15 infrared2)
   goals met: 4 of 4
